WelcomePage.yaml
execution:
- executor: jmeter
  concurrency: 15
  ramp-up: 60s
  hold-for: 1m
  scenario: JMX
  locations: 
    us-east-1: 1          # US East (N. Virginia)

provisioning: cloud

modules:
  cloud:
    account: DoubleOZero
    send-report-email: false
    project: Test The Thing
    workspace: DoubleOZero

scenarios:
  JMX:
    script: WelcomePage.jmx